Revit 2024 API
ScheduleFieldId Class
The ScheduleFieldId object is used as a unique identification for a field in a schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ScheduleFieldId
Visual Basic
Public Class ScheduleFieldId
Visual C++
public ref class ScheduleFieldId
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ScheduleFieldId
See Also
ScheduleFieldId Members
Autodesk.Revit.DB Namespace